// script.js
var polygon = [
    [ 41.80108121884127, -6.761091260747447 ],
    [ 41.80100840682658, -6.761687068627779 ],
    [ 41.80071792309286, -6.762286454519129 ],
    [ 41.80035249366738, -6.762950150575533 ],
    [ 41.80011720182389, -6.763293399258999 ],
    [ 41.79968660172063, -6.763668178523233 ],
    [ 41.79933390415669, -6.76410946191498 ],
    [ 41.79905944331669, -6.764496646093678 ],
    [ 41.79917243755256, -6.765727393608241 ],
    [ 41.79929189314392, -6.766719389319426 ],
    [ 41.79945642081054, -6.767790236109007 ],
    [ 41.79943424960979, -6.768646510794554 ],
    [ 41.79936116287621, -6.769358920223373 ],
    [ 41.79913037797305, -6.769952281373087 ],
    [ 41.79879499338396, -6.770564542586985 ],
    [ 41.79824562369015, -6.771016897618518 ],
    [ 41.79767410013917, -6.771214164758571 ],
    [ 41.79724210074475, -6.77124850390191 ],
    [ 41.79676102120609, -6.771107119597556 ],
    [ 41.79555840818522, -6.770414316890363 ],
    [ 41.7948934728154, -6.770317873270313 ],
    [ 41.79209147440712, -6.770390770816462 ],
    [ 41.79197613257484, -6.77015480162014 ],
    [ 41.79214558584582, -6.769848398296656 ],
    [ 41.79260427012982, -6.769561077755037 ],
    [ 41.79346109360979, -6.769202666251531 ],
    [ 41.7943196437703, -6.768502137679391 ],
    [ 41.79558869842504, -6.76677528882546 ],
    [ 41.79708612732554, -6.764161980429177 ],
    [ 41.79749076973332, -6.763247479977363 ],
    [ 41.79788248073648, -6.76268778347175 ],
    [ 41.79849523706159, -6.762447146221204 ],
    [ 41.79883220378525, -6.762327206818175 ],
    [ 41.79926145533302, -6.762243040629986 ],
    [ 41.79957121673802, -6.762200084417969 ],
    [ 41.79985213589703, -6.761822410982253 ],
    [ 41.80005975869448, -6.761503442063056 ],
    [ 41.80030673641834, -6.761070311616607 ],
    [ 41.80047256922975, -6.760635835314361 ],
    [ 41.80096220955807, -6.760393871857361 ],
    [ 41.80108121884127, -6.761091260747447 ]
];

var canvas = document.getElementById("canvas");
var context = canvas.getContext("2d");

function renderPolygon(points) {
    context.beginPath();
    context.moveTo(points[0][0], points[0][1]);

    for (var i = 1; i < points.length; i++) {
        context.lineTo(points[i][0], points[i][1]);
    }

    context.closePath();
    context.stroke();
}

function Point(context, x, y, radius = 5, color = "red") {
    context.fillStyle = color; // Define a cor do ponto
    context.beginPath();
    context.arc(x, y, radius, 0, Math.PI * 2, true); // Desenha um círculo
    context.fill(); // Preenche o círculo com a cor definida
}

// Chame a função para renderizar o polígono

//Point(context, 100, 100);
//renderPolygon(S);
renderPolygon(polygon);


function ray_casting(point, polygon){
    var n=polygon.length,
        is_in=false,
        x=point[0],
        y=point[1],
        x1,x2,y1,y2;

    for(var i=0; i < n-1; ++i){
        x1=polygon[i][0];
        x2=polygon[i+1][0];
        y1=polygon[i][1];
        y2=polygon[i+1][1];

        if(y < y1 != y < y2 && x < (x2-x1) * (y-y1) / (y2-y1) + x1){
            is_in=!is_in;
        }
    }

    return is_in;
}
//var ray_casting(Point,renderPolygon);
for(var i = 0; i<2000; i++){
    var x = parseInt(Math.random()* 450);
    var y = parseInt(Math.random()* 450);
    var point = [x,y];
    var is_in = ray_casting(point,polygon);
    if (is_in){
        Point(context,x,y,4,"green");
    }
    else{
        Point(context,x,y,4,"red");
    }
} 

if(ray_casting([41.7969700, -6.7661794],polygon)){
    console.log("to aqui");
}
else{
    console.log("n to");
}

